[SEACAD]
##TIP
IDC_STATIC_WWW                     =   http://www.basiliang.com
SEA_MALLOC_FAIL                    =   Fail to apply for memory
IDS_CHOOSE_COLOR                   =   Pleaase choose color
IDS_SAVE_PARAM_OK                  =   Save Param ok!
IDS_SAVE_FILE_OK                   =   Data is Success Saved!
IDS_MSG_MRAK_FLY                   =   Please DISABLE fly mark

##DLG－ABOUT
DLG_ABT_CAD                        =   About SeaCad
IDC_STATIC_VER                     =   Edition SeaCAD 3.0.2.3.41201
IDC_STATIC_WARN                    =   Warning: ALL RIGHT RESERVED(C) 2013-2020
COMPANY_BSL                        =   Changsha bsl information technology co.,Ltd
APP_ISRUNING                       =   This software has been in operation
QUIT                               =   Quit
TIP_IDOK                           =   Confirm
IDCANCEL                           =   Cancel
##Menu
IDS_MENU_FILE                      =   File
IDS_MENU_FILE_NEW                  =   New
IDS_MENU_FILE_OPEN                 =   Open
MENU_FILE_SAVE                     =   Save
MENU_FILE_SAVE_AS                  =   Save as...
MENU_FILE_PRINT                    =   Print Ctrl+P
MENU_FILE_SCANIMAGE                =   Scan I&mages...
MENU_FILE_SYSTEM                   =   System &parameter...
MENU_FILE_IMGLIB                   =   Images &library...
MENU_FILE_MRU_FILE1                =   Recent file
IDS_MENU_FILE_CLOSE                =   &Close
IDS_MENU_FILE_EXIT                 =   &Exit

##
MENU_EDIT                          =   &Edit
MENU_EDIT_UNDO                     =   &Undo
MENU_EDIT_REDO                     =   &Redo
MENU_EDIT_CUT                      =   Cu&T Ctrl+X
MENU_EDIT_COPY                     =   &Copy Ctrl+C
MENU_EDIT_PASTE                    =   &Paste
MENU_EDTI_ALL                      =   select&All Ctrl+A
MENU_EDIT_UNALL                    =   Unslect all
MENU_EDIT_DEL                      =   Delete
MENU_EDIT_COMBINE                  =   Combine     Ctrl+L
MENU_EDIT_UNCOMBINE                =   Uncombine Ctrl+K
MENU_EDIT_GROUP                    =   Group     Ctrl+G
MENU_EDIT_UNGROUP                  =   Ungroup Ctrl+U
MENU_EDIT_TOCURVE                  =   TO Curve  Ctrl+Q
MENU_EDIT_TODASHED                 =   To Dashed
MENU_EDIT_UNGROUPTEXT              =   Ungroup Text
MENU_EDIT_HATCH                    =   Hatch      Ctrl+H


MENU_DRAW                          =   &Draw
MENU_DRAW_POINT                    =   &Point
MENU_DRAW_CURVE                    =   Cu&rve
MENU_DRAW_LINE                     =   &Line
MENU_DRAW_RECT                     =   &Rect
MENU_DRAW_CIRCLE                   =   &Circle
MENU_DRAW_ELLIPSE                  =   &Ellipse
MENU_DRAW_POLY                     =   Poly&gon
MENU_DRAW_TEXT                     =   &Text
MENU_DRAW_PICF                     =   Pic&ture File
MENU_DRAW_BMPFILE                  =   &Bitmap File
MENU_DRAW_VECTORFILE               =   &Vector File
MENU_DRAW_TIMER                    =   Ti&mer
MENU_DRAW_INPUT                    =   &Input IO
MENU_DRAW_OUTPUT                   =   &Onput IO
MENU_DRAW_ENCODERDIST              =   Encoder Distance
MENU_DRAW_SPIRAL                   =   Spriral


MENU_MODI                          =   &Modify
MENU_MODI_ARRAY                    =   Array
MENU_MODI_TRANSFORM                =   Transform
MENU_MODI_MOD                      =   Model
MENU_MODI_TRIM                     =   Trim
MENU_MODI_BKCRSPT                  =   Break Cross Point
MENU_MODI_AUTOCON                  =   Auto Connection
MENU_MODI_RESORT                   =   Resort
MENU_MODI_ALIGN                    =   Allign

MENU_ALIGN_BOTTOM                  =   Bottom
MENU_ALIGN_CENTER                  =   Center
MENU_ALIGN_CENTER_HOR              =   Hor center
MENU_ALIGN_CENTER_VER              =   Ver center
MENU_ALIGN_LEFT                    =   Left
MENU_ALIGN_RIGHT                   =   Right
MENU_ALIGN_TOP                     =   Top

##
MENU_VIEW                          =   &View
MENU_VIEW_SYS                      =   &System menu bar
MENU_VIEW_WID                      =   &Window bar
MENU_VIEW_TOOLBAR                  =   System &Tool bar
MENU_VIEW_ZOOMBAR                  =   View bar
MENU_VIEW_DRAWBAR                  =   &Draw bar
MENU_VIEW_ZOOM                     =   Zoom bar
MENU_VIEW_ASS                      =   Assist bar
MENU_VIEW_ALL                      =   Align bar
MENU_VIEW_OBJ                      =   Object list
MENU_VIEW_ENTPROP                  =   Object property
MENU_VIEW_MAKPAR                   =   Mark parameter
MENU_VIEW_LAS                      =   Laser
##
MENU_VIEW_STATUS_BAR               =   &Status bar
ENTPROP                            =   Object property
MENU_VIEW_RULER                    =   Show ruler
MENU_VIEW_GRID                     =   Show grid
MENU_VIEW_GUILD                    =   Show guild
MENU_VIEW_PATH                     =   Show path
MENU_VIEW_SNAPGRID                 =   Snap grid
MENU_VIEW_SNAPGUILD                =   Snap guild
MENU_VIEW_SNAPOBJECT               =   Snap Object
MENU_VIEW_TRAK                     =   Track Preview
MENU_VIEW_IOSTATE                  =   IO State
MENU_VIES_GENCODE                  =   Generate Gcode

##
MENU_SPECIAL                       =   &Special
MENU_SPE_CHGTXT                    =   Change text
MENU_SPE_VARTXT                    =   Serial text
MENU_SPE_SNEXTADD                  =   SN add
MENU_SPE_SNEXTDEL                  =   SN decline
MENU_SPE_SNEXTRESET                =   sN reset

##
MENU_LASER                         =   &Laser
MENU_LAS_ANGLEROTATE               =   Rotate angle mark
MENU_LAS_ANGLEROTATE2              =   360 degree Rotate angle mark
MENU_LAS_EXTAXI                    =   Extension axis mark
MENU_LAS_RINGMARKF5                =   Ring mark(F5)
LASERREADYIO                       =   Laser ready IO
##
MENU_CALIB                         =   Calibration(&C)
IDM_INIT_CALIB                     =   Init value Cal 
IDM_LSM_CALIB                      =   Curve fiting Cal
##
MENU_HELP                          =   help(&H)
MENU_ABOUT                         =   About SEACAD(&A)
MENU_CHA_VIEW                      =   Change view
MENU_OF2003                        =   Office2003 silver
MENU_OF2007                        =   Office2007 silver gray
MENU_OF2007BLU                     =   Office2007 blue
MENU_OF2010H                       =   Office2010 brown
MENU_OF2010Y                       =   Office2010 silver

##
MENU_POP_LOCK                      =   Lock object
MENU_POP_UNLOCK                    =   Unlock pick object
MENU_POP_PRE                       =   Move previous
MENU_POP_AFT                       =   Move after
MENU_POP_TOP                       =   Move top
MENU_POP_BOT                       =   Move bottom
MENU_POP_FINISH                    =   &Finish
MENU_POP_COOR                      =   &Input coordinate 87
MENU_POP_CLOSEFINISH               =   &Close finish
MENU_POP_MODIFYCOLOR               =   Modify color 99
MENU_POP_MODIFPARAM                =   Modify parameter
MENU_POP_APPLYTOPICK               =   Apply to pick object
MENU_POP_SETDFT                    =   Set default pen
MENU_POP_SETMARK                   =   Set mark


##DLG_ROT0
DLG_ROT0_TITLE                     =   Rotate angle mark 
DLG_ROT0_EXT_LJ                    =   Part
DLG_ROT0_CURTM                     =   Current time
DLG_ROT0_ANGLE                     =   Current angle
DLG_ROT0_CNT                       =   Count 
DLG_ROT0_TOTAL                     =   Total time
DLG_ROT0_MVRT                      =   Movement angle
DLG_ROT0_CTWK                      =   Continue work
DLG_ROT0_SELWK                     =   Select work
IDC_CHK_MARK_WHOLE_SHAPE           =   Whole Graph Mark
IDC_STATIC_GRAPH_GAP               =   Graph Gap
DLG_ROT0_BTN_RDLT                  =   Red light
DLG_ROT0_BTN_MK                    =   Mark
DLG_ROT0_BTN_PARA                  =   Parameter
DLG_ROT0_BTN_EXIT                  =   EXIT
IDS_NO_MARK                        =   No mark......
IDS_MARK_FINISH                    =   Mark finish
IDS_MARK                           =   Mark



##DLG_ANGLERORATE
IDC_RATE_TITLE                     =   Extend Axis Mark
IDC_STATIC_RT_LJ                   =   Part
IDC_STATIC_CUR                     =   Current time
IDC_STATIC_RATE_CNT                =   Count
IDC_STATIC_RATE_TOTAL              =   Total time
IDC_STATIC_STEP                    =   Step
IDC_STATIC_SPLIT                   =   Split ruler
IDC_BUTTON_AXIS_DIA                =   Diameter
IDC_STATIC_MM                      =   MM
IDC_FOCUSLENGTH                    =   Focus Length

##DLG_Rotate Mark 2
IDC_RATE2_TILTLE                   =   360 degree Rotate angle mark
IDC_STATIC_ROT2_INC                =   Increase
IDC_CHECK_360DG                    =   360 degree mark
IDC_CHECK_TOTALNUM                 =   Total number

##DLG_Auto Connection
DLG_AUTO_CNN_TITLE                 =   Auto connection
##DLG_CHANGE TEXT                     =
DLG_CHGTXT_TITLE                   =   Change text
IDC_STATIC_CHETXT                  =   Source text
IDC_STATIC_TXTDEST                 =   Transformed text

##Advance mark param
IDC_STATIC_ADV_JP                  =   Jump Speed
IDC_STATIC_JPDELAY                 =   Jump speed delay
IDC_STATIC_JPDT_DELAY              =   Jump distance delay
IDC_STATIC_EPOFF                   =   End compensate
IDC_STATIC_ACDT                    =   Acc. Distance
IDC_STATIC_MKTM                    =   Time per point
IDC_PULSE_POINT_MODE               =   Vector point mode
IDC_STATIC_PERPULSE                =   Pulse per point
IDC_STATIC_MMS                     =   MM/sec
IDC_STATIC_UM                      =   UM
##IDC_STATIC_UM2                   =   UM2
IDC_STATIC_MS                      =   MS
IDC_WOBBLE                         =   Wobble
IDC_STATIC_DIA                     =   Diameter
IDC_STATIC_DIT                     =   Distance
IDC_END_ADD_POINTS                 =   Edd add points
IDC_STATIC_NUM                     =   Number
IDC_STATIC_DITADV                  =   Distance
IDC_STATIC_MKTIME                  =   Mark time
IDC_STATIC_MKCNT                   =   Mark count

##IMGDLG
IDC_STATIC_LIB_NAME                =   Library name
IDC_STATIC_LIB_PRE                 =   Library preview
IDC_STATIC_LIB_TIP                 =   Drag the image to workspace
IDC_BUTTON_NEWLIB                  =   New library
IDC_BUTTON_DELLIB                  =   Delete library
IDC_BUTTON_ADDIMG                  =   Add image
IDC_BUTTON_DELIMG                  =   Delete image
IDS_COMMON_IMG                     =   Common Image

##Input port DLG                   =
DLG_INPUT_TITLE                    =   IO Input
IDC_STATIC_IOCTL                   =   IO control

##IO DLG
DLG_IO_TITLE                       =   IO
IDC_STATIC_INPUT_IO                =   IO Input
IDC_STATIC_OUT_IO                  =  IO Output

## Control DLG                     =
IDS_REDLIGHT                       =   Red Lase Pointing....
IDS_MARKING_FLY                    =   Fly marking....
IDS_MARKING_INPUT                  =   Input port is checking the mark...
IDS_TMP_HIGH                       =   Laser temperature is too high, please set no for checking laser state to continue marking.
IDS_LASER_CLOSED                   =   Laser is closed,please set no for checking laser state to continue marking.
IDS_LASER_ABNORMAL                 =   Laser：mo（master oscillator）abnormal,please set no for checking laser state to continue marking.
IDS_COMMON_IMG                     =   Common image
IDS_STATE_ERROR                    =   Laser state error, please set no for checking laser state.
IDS_QUIT_MARK                      =   Are you sure to quit marking?
IDS_COM_ERROR                      =   com cannot work，please check its state!
##Select param from param library DLG    
DLG_PUT_PARA_TITLE                 =   Select param from library
IDC_BUTTON_SAVEAS                  =   Save current param as
IDC_BUTTON_DEL_SELECT              =   Delete selected param
IDC_BUTTON_SET_DEFAULT             =   Apply to &default



##Add picture DLG                  =
DLG_PIC_ATT_TITLE                  =   New picture
IDC_STATIC_PIC_NAME                =   Please input picture name

##Add library DLG                  =
DLG_PIC_LIB_ATT_TITLE              =   New library
IDC_STATIC_LIB_PIC_NAME            =   Please input library name

##Ring mark DLG                    =
DLG_RING_MK_TITLE                  =   Ring mark
IDC_STATIC_RING_LJ                 =   Part
IDC_STATIC_RING_CUR                =   Current time
IDC_STATIC_RING_CNT                =   Total count
IDC_STATIC_RING_TIME               =   Total time
IDC_CHECK_SELECT                   =   Ring Selected 
IDC_CHECK_RING_INNER               =   Ring inner
IDC_STATIC_RING_DIA                =   Ring Diameter
IDC_STATIC_RING_THK                =   Ring thickness
IDC_STATIC_RING_DEGREE             =   Degree
IDC_STATIC_RING_STEP               =   Movement step
IDC_CHK_MONITOR_INPORT             =   Monitor inport signal

##Configuration param DLG
DLG_CFG_PARA_TITLE                 =   Configuration param markcfg00
IDS_LASER_RING_PARAM_EXT           =   Extend axis
##
IDC_CHK_REV_ROT                    =   Reverse rotate
IDC_CHK_ROTATE                     =   Rotate Axis
IDC_STATIC_EXT_MULSE               =   Pulses per round
IDC_STATIC_EXT1                    =   Pulse
IDC_STATIC_MININD                  =   Min Coor.
IDC_STATIC_MAXIND                  =   Max Coor.
IDC_STATIC_PULPERSEC               =   Pulse per sec
IDC_STATIC_PAREXT_MINV             =   Min Speed
IDC_STATIC_PAREXT_MAXV             =   Max Speed
IDC_STATIC_PAREXT_ACT              =   Acc. time
IDC_STATIC_PAREXT_OFMV             =   Compensate movement 
IDC_STA_RING_COMP_BL               =   Ratio Compensate
IDC_STA_RING_COMP_JX               =   Gap Compensate
IDC_STA_RING_COMP_CW               =   Malposition Compensate
IDC_CHECK_FINISH_GOTOO_RI          =   Go to start position after finishing
IDC_STATIC_WKFRE                   =   Motor Speed
IDC_CHECK_ZERO                     =   Zero
IDC_STATIC_PAREXT_ZERO             =   Speed of Go Zero
IDC_STATIC_PAREXT_ZESUP            =   Axis home time out
IDC_STATIC_SED                     =   Second
IDC_CHECK_ACCURATE                 =   Accurate zero

##Select according to pen ID DLG
DLG_SEL_BY_PEN_TITLE               =   By pen title
IDS_PEN_ID                         =   Pen ID
IDS_PEN_COLOR                      =   Color

IDS_STEP_DIST                      =   Step distance(mm)
IDS_SPEED                          =   Speed(mm/s)
IDS_LASER_POWER                    =   Power(%)
IDS_SAVE_CURRENT                   =   Save current
IDS_PULSELOWMAXFREQ                =   Pulse frequency lower the max frequency
IDS_MINFREQ                        =   Mini frequency

IDS_PULSEGREATEMAXFREQ             =   Pulse frequency greater the max frequency
IDS_MAXFREQ                        =   Max frequency
IDS_SPDLOWMINSPD                   =   Speed lower mini speed!
IDS_MINSPD                         =   Mini speed
IDS_SPDGREATEMAXSPD                =   Speed greater max speed!
IDS_MAXSPD                         =   Max speed
IDS_OPEN_SHX                       =   Open a SHX
IDS_OPEN_DXFONT_ERR                =   Can not open Jsf font
IDS_DRAW_SPIRAL_ERR                =   Can not draw spiral
IDS_CREATE_SPIRAL_ERR              =   Can not create spiral, the border size is too small.
IDS_OPEN_PICTURE_ERR               =   Can not open picture 
IDS_GET_PICFILE_ERROR              =   Can not get picture file
IDS_PICTYPE_ERR                    =   Not correct picture type.
IDS_ONLY_DEAL_GRAYPIC              =   Only deal with gray picture
IDS_INIT_BARERR                    =   Can not initialize bar code.
IDS_LOAD_FONT                      =   The font list is loading, please try it later.
IDS_SELECT_ENTITY                  =   Please select a entity
IDS_GAP_TIP                        =   The minimum gap should be 0.01
IDS_MARK_MAP_ERR                   =   Can not mark map
IDS_PARSE_HATCH_ERR                =   Can not parse hatch 
IDS_COPY                           =   Copy
IDS_OBJECT_LIST                    =   Object list
IDS_WELDTO                         =   Weld to...
IDS_TRIMTO                         =   Trim to...
IDS_INTERSECTTO                    =   Intersect to...
IDS_NAME                           =   Name
IDS_TYPE                           =   Type
IDS_MARK_TYPE                      =   Mark type
IDS_TRUE_TYPE                      =   TrueType
IDS_JXF_FONT                       =   Jsf Font
IDS_BAR_FONT                       =   BarCode Font
IDS_ADMIN                          =   Administrator
IDS_DESIN                          =   Designer
IDS_YEAR                           =   Year
IDS_MONTH                          =   Month
IDS_DAY                            =   Day
IDS_LOCK                           =   Lock
IDS_PEN_ID                         =   Pen ID
IDS_PEN_COLOR                      =   Color
IDS_PEN_SWITCH                     =   Switch
IDS_ADVANCE                        =   Advance...
IDS_APPLY_TO_DEFAULT               =   Apply to default
IDS_LOAD_DEFAULT                   =   Load default
IDS_TYPENAME_SCREWLINE             =   Screw line
IDS_AUTOSAVE_CHECK                 =   Check
IDS_AUTOSAVE_STATIC_MINUTE         =   Minute,autosave
IDR_TOOLBAR_DRAW                   =   Show or hide draw bar
IDS_TIPS_ZOOM_MAX                  =   Show or hide Zoom bar 
IDS_TIPS_ROTATE_RANGLE             =   Rotate center is beyond the range!
IDS_SETTING_TREE_GENERAL           =   General
IDS_SETTING_TREE_COLOR             =   Color
IDS_SETTING_TREE_WORKPLACE         =   Workplace
IDS_SETTING_TREE_AUTOSAVE          =   Autosave
IDS_SETTING_TREE_MOVEROTATE        =   Move rotate
IDS_SETTING_TREE_PLUGMANAGE        =   Plug manage
IDS_SETTING_TREE_USER              =   User manage
IDS_SETTING_TREE_LANGUAGE          =   Languge
IDS_SET_G_UNIT_TYPE                =   Unit type
IDS_SET_G_PASTE_X                  =   Paste X
IDS_SET_G_PASTE_Y                  =   Paste Y
IDS_SET_G_GRID                     =   Grid
IDS_SET_G_SHOWGRID                 =   Show grid
IDS_SET_G_GRID_DISTANCE            =   Grid distance
IDS_SET_G_I_MASK                   =   Input IO mask
IDS_SET_G_O_MASK                   =   Output IO mask
IDS_SET_G_MARKING_MUTEX            =   Enable Marking Mutex
IDS_SET_G_EXECUTE_START            =   Execute main program when it Starts
IDS_SET_G_EXECUTE_FINISH           =   Execute main program when it finishes
IDS_TYPENAME_ELLIPSE               =   Ellipse
IDS_SAVE_FINISH                    =   Save finish
IDS_TYPENAME_ELLIPSEARC            =   Ellipsearc
IDS_TYPENAME_CIRCLE                =   Circle
IDS_STRAT_DEGREE                   =   Start degree
IDS_END_DEGREE                     =   End degree
IDS_DEGREE                         =   Degree
IDS_TYPENAME_RECTANGLE             =   Rectangle
IDS_ROUND_STEP                     =   Round step
IDS_ROUND_ALL                      =   Round all
IDS_TYPENAME_BEZIER                =   Bezier
IDS_INCH                           =   Inch
IDS_MM                             =   MM
IDS_BK                             =   Background
IDS_CENTERLINE                     =   Center line
IDS_TYPENAME_TEXT                  =   Text
IDS_TYPENAME_PICTURE               =   Picture
IDS_SHOW_WORKSPACE                 =   Show workspace
IDS_SHOW_ROUND                     =   show round
IDS_SHOW_CROSS                     =   Show cross
IDS_LOWERLEFT                      =   Lower left
IDS_SIZE                           =   Size
IDS_HEIGHT                         =   Height
IDS_WIDTH                          =   Width
IDS_FUNC_ERROR                     =   Implement the function in a derived class.
IDS_CHOOSE_COLOR                   =   Choose color
IDS_EXIT_ROTATE                    =   Are you sure to exit rotate mark? 
IDS_SPLIT_OUTRANGE                 =   Split size must be smaller than part radius!
IDS_ROTARYMARK                     =   ExtAxis mark
IDS_CURNUMGREATETOTALNUM           =   Current mark count is already greater than total count!
IDS_TIPS_TURN_D2                   =   Turn to list property bar 
IDS_ERR_DOOROPEN                   =   Door is opened,please close it!
IDS_CHANGE_TEXT                    =   Please input the text required to be switched! The value can not be empty!
IDS_PSWINCORRECT                   =   Incorrect passward, please try again!
IDS_QUIT_MARK                      =   Are you are to quit marking?
IDS_SAVE_CURRENT                   =   Succeed to save current setting as default configuration
IDS_PULSELOWMAXFREQ                =   Pulse frequency lower max frequency
IDS_MINFREQ                        =   Mini frequency
IDS_PULSEGREATEMAXFREQ             =   Pulse frequency greater max frequency
IDS_MAXFREQ                        =   Max frequency
IDS_SPDLOWMINSPD                   =   Speed lower min speed！
IDS_MINSPD                         =   Mini speed
IDS_SPDREATEMAXSPD                 =   Speed greater max speed！
IDR_TOOLBAR_ASSISTANT              =   Assist toolbar. Image lock, unlock，at the origin.
IDS_TIPS_TURN_D1                   =   Turn to mark param bar
IDS_MK_OPER                        =   Mark operation bar

IDS_OPEN_COM_ERR                   =   Can not open com!
IDS_PWD_ERROR                      =   Entered passwords differ
IDS_USER_EXIST                     =   User name exists! Please input another name!
IDS_INPUT_USER                     =   Please input a user name!
IDS_INVALID_BAR                    =   Invalid barcode, please reset the code!
IDS_TIPS_ZOOM_MIN                  =   Size <0.001mm  beyond the precision！
IDS_MARKING                        =   Marking......
IDS_STOP_MARK                      =   Stop mark
IDS_MARK_STOPPED                   =   Mark stopped！
IDS_POWER_ON                       =   Power on
IDS_POWER_OFF                      =   Power off
IDS_STEP_MARK                      =   Mark step(mm)
IDS_CURRENT                        =   current(A)
IDS_SPEED                          =   speed(mm/sec)
AFX_IDS_APP_TITLE                  =   SeaCad
IDS_APP_TITLE                      =   LMC1
IDS_INPUT_NUM                      =   Please input a number
IDS_TIP_MAX_DA                     =   Max DA：4096
IDS_DISTORTION                     =   Param range:0.8~1.2
IDS_LINKERROR                      =   Can not link to laser control card, please check the link!
IDS_PAR_CAL_ERRPR                  =   Param calculate error
IDS_FLY_MARK_PARA_CAL              =   Fly param caculate
IDS_PWD_ERROR_                     =   The password is invalid!
IDS_LASER_OUT                      =   Click confirm to output laser, are you sure to output laser? 

IDS_WARING                         =   Warning
IDS_PORT_ERROR                     =   Please attention the outport are conflict! Please select again!
IDS_PWD_CON_EEROR                  =   Entered passwords differ, please input again!
IDS_ENABLE_POWER                   =   Enable Power analog output
IDS_POWER_MAP                      =   Power map
IDS_ENABLE_ANGLOG_OUT              =   Enable current output
IDS_ANALOG_MAP                     =   Current Map
IDS_LASER_ON                       =   Laser on
IDS_LASER_OFF                      =   Laser off
IDS_LASER_TEST                     =   Laser test
IDS_CON                            =   New Coefficient：
IDS_USE_CON                        =   Please click[confirm] to use this Coefficient!
IDS_FIELD                          =   Field
IDS_LASER_CONTROL                  =   Laser control
IDS_PORT                           =   Port
IDS_OTHER                          =   Other
IDS_TYPENAME_INPUT                 =   Input
IDS_TYPENAME_OUTPUT                =   OUtput
IDS_TYPENAME_POLYGON               =   Polygon
IDS_TYPENAME_COMBINE               =   Combine
IDS_TYPENAME_POINT                 =   Point
IDS_TYPENAME_DELAYEDTIMER          =   Delayed Timer

IDR_TOOLBAR_ALIGN                  =   Show or hide align toolbar
IDS_NEW_LIB_TIP                    =   Please establish new library, then save image! 
IDS_INPUT_IMGNAME                  =   Please input image name
IDS_HAVEIMG_TIP                    =   The library specified has been existed,please input again
IDS_INPUT_LIBNAME                  =   Please input library name
IDS_HAVELIB_TIP                    =   The library specified has been existed,please input again
IDS_PARAMNAMEEXIST                 =   Param name exists! Do you want to cover the old param?
IDS_REALYAPPDEF                    =   Are you sure to set the current param as default param?
IDS_CHECK_LINK                     =   Mark control card link error, please check link......
IDS_ENCRYPTION_ERR                 =   Board encryption error 
IDS_NO_OBJECT                      =   No object selected
IDS_SELECT                         =   select
IDS_OBJECT_SELECTED                =   Object selected
IDS_OBJECT                         =   Object:
IDS_DEV_COR                        =   Device coor
IDS_PAPER_COR                      =   Paper coor
IDS_ZOOM_SCALE                     =   Show ratio 

IDS_NOENTITY_SELECT                =   No data available. Check whether the object was selected!
IDS_NOENTITY                       =   No data available. Check whether the file was loaded!
IDS_CACHE_FULL                     =   Mark cache is full, please test the standard card!\r\n click [confirm] to try again.
IDS_PLT_TIPS                       =   Numbers or “+、-” after space in plt!
IDS_SELECT_ERR                     =   Not choosing the right object, please choose again!
IDS_CANNOT_OPEN_FILE               =   Can not open file!
IDS_PLT_INVALID_CHAR               =   Invalid character in PLT!
IDS_ENCODE_ERR                     =   Hardware system encode error, system will stop working.
IDS_VERSION_ERR                    =   Software version and hardware system are not compatible
IDS_ERROR                          =   Error
IDS_LINK_ERR                       =   Can not link mark control card, program work at demo state(can not mark)!
IDS_NOFONTS                        =   No fonts available, please contact the administrator.
IDS_INVALID_FONT                   =   Invalid font, use other fonts.
IDS_ERR_BAR_TYPE                   =   Can not find bar type
IDS_OPEN_LINEFILE_ERR              =   Open line file error:
IDS_TCP_LINK_ERR                   =   Link to server error!
IDS_TYPENAME_CODEBAR               =   Bar code
IDS_TYPENAME_FILLED                =   Filled
IDS_STATUS                         =   No selection

IDS_MOUSE_XY                       =   Coor
IDS_FILESAVE_STRING                =   Do you want to save the current file?
IDS_FILESAVE_TITLE                 =   Save prompt
IDS_TYPENAME_LINE                  =   Line
IDS_TYPENAME_POLYLINE              =   Polyline
IDS_TYPENAME_GROUP                 =   Group
IDS_SWITCH_ON                      =   On
IDS_SWITCH_OFF                     =   Off

IDS_READY                          =   Ready
IDS_SNAP                           =   Snap
IDS_GUID_LINE                      =   Guid line

## Password DLG                    =
DLG_PWD_TITLE                      =   Password title
IDC_STATIC_NAME                    =   Name
IDC_STATIC_PWD                     =   Password
IDC_STATIC_CFMPWD                  =   Confirm password

##Rotate Param Config and Axis check DLG        
IDD_DLG_ROTATE_CFG                 =   Rotate parameter config and Axis Check
IDC_STATIC_ROT_STEP_ANGLE          =   Move Angle

##Rotate angle mark param setting DLG        
DLG_ROT_ANG_TITLE                  =   Rotate mark parameter config

##Input param name DLG             
DLG_INPUT_PARA_TITLE               =   Input param title
##Part diameter DLG                
DLG_WKDIA_TITLE                    =   Work diameter

##Convert to dashed DLG            
DLG_TRAN_TITLE                     =   Convert To Dashed
IDC_STATIC_LINELEN                 =   Line length-L1
IDC_STATIC_LINEINTER               =   Line interspace-L2

##Barcode DLG                      
DLG_BARCODE_TITLE                  =   Barcode
IDC_STATIC_TEXT                    =   Text
IDC_CHECK_SHOW_TEXT                =   Show text
IDC_STATIC_TXTHIT                  =   Text height
IDC_STATIC_TEXTWID                 =   Text width
IDC_TEXT_OFFSETX                   =   Text offset X
IDC_TEXT_OFFSETY                   =   Text offset Y
IDC_TEXT_TEXTSPACE                 =   Text space
IDC_CHECK_REVERT                   =   Check revert
IDC_GRP_QUIET                      =   Quiet
IDC_STATIC_TOP                     =   Top
IDC_STATIC_LEFT                    =   Left
IDC_STATIC_RIGHT                   =   Right
IDC_STATIC_BOTTOM                  =   Bottom
IDC_STATIC_HEIGHT                  =   Code height
IDC_STATIC_STAWD                   =   Standard module width
IDC_STATIC_RATIO                   =   Ratio
IDC_STATIC_BAR                     =   Bar
IDC_STATIC_SPACE                   =   Space
IDC_STATIC_PENID                   =   Pen ID
IDC_STATIC_FONT                    =   Font

##GCODE DLG
DLG_CGODE_TITLE                    =   GCODE

##Hatch DLG                        
DLG_FILL_TITLE                     =   Fill
IDC_CHECK_ENABLE_OUTLINE           =   Enable outline
IDC_CHECK_OUTLINE_FIRST            =   Outline first
IDC_RADIO_FILL_1                   =   Fill 1
IDC_RADIO_FILL_2                   =   Fill 2
IDC_RADIO_FILL_3                   =   Fill 3
IDC_CHECK_ENABLE                   =   Enable
IDC_STATIC_TYPE                    =   Type
IDC_CHECK_COUNT_ALL                =   Count all
IDC_CHECK_ROUND_INVERT             =   Round invert
IDC_CHECK_ALONG_BORDER             =   Along border
IDC_CHECK_KEEP_SEPERATE            =   Keep seperate
IDC_STATIC_ANGLE                   =   Angle
IDC_GRP_MUTCP                      =   Multicomputing
IDC_RADIO_EXECUTE                  =   Default
IDC_RADIO_EXECUTE_2                =   Intersection
IDC_RADIO_EXECUTE_3                =   Union
IDC_RADIO_EXECUTE_4                =   Substraction
IDC_STATIC_LISTDIST                =   List distance
IDC_CHECK_ARRANGE_EQUALLY          =   Arrange equally
IDC_STATIC_EDG                     =   Edge
IDC_STATIC_STARTOFFSET             =   Start offset
IDC_STATIC_ENDOFFSET               =   End offset
IDC_STATIC_LINEREDUCTION           =   Line reduction
IDC_STATIC_NUMLOOPS                =   Num Loops
IDC_STATIC_LOOPDIST                =   Loop distance
IDC_BUTTON_DEL                     =   Undo Hatch
##Path text DLG                    
DLG_PATH_FONT_TITLE                =   Path text
IDC_STATIC_BASEANG                 =   Base angle
IDC_CHECK_BASE                     =   Angle range
IDC_CHK_INVERT                     =   Invert
IDC_CHK_ALLIG_TOP                  =   Align top
##Font DLG
DLG_FONT_TITLE                     =   Font
IDC_STATIC_ALLIGN                  =   Align style
IDC_RADIO_ALIGN_LEFT               =   left
IDC_RADIO_ALIGN_LEFT3              =   Middle
IDC_RADIO_ALIGN_LEFT2              =   Right
IDC_CHECK_BOLD                     =   Bold
IDC_CHECK_ITALIC                   =   Italic
IDC_CHECK_EUQAL_WIDTH              =   Equal width
IDC_STATIC_CH_WID                  =   Width
IDC_STATIC_CHA_ANG                 =   Angle
IDC_STATIC_CHA_INT                 =   Interval
IDC_STATIC_LINE_INT                =   Line interval
IDC_STATIC_CHA_HEI                 =   %  Height
IDC_STATIC_DEGREN                  =   Degree   (-89,89)
IDC_STATIC_DIR                     =   Direction
IDC_RADIO_HORIZONTAL               =   Horizontal
IDC_RADIO_VERTICAL                 =   Vertical
IDC_CHECK_ROUND                    =   Round
IDC_STATIC_DIA_C                   =   Circle diameter
IDC_CHECK_INVERT                   =   Invert
IDC_CHECK_UPSIDEDOWN               =   Upsidedown
IDC_CHECK_LIMIT_ANGLE              =   Angle limit
ID_BUTTON_APPLY                    =   Apply

##Input coor DLG
DLG_INPUT_IND_TITLE                =   Input coor

##User selection DLG               
DLG_USER_SEL_TITLE                 =   User selection
IDC_STATIC_USER                    =   User
IDC_STATIC_PWD                     =   Password

##Mark control--not used temporarily          

IDC_BUTTON_MARK                    =   Mark(F2)
IDC_CHECK_CONTINUOUS               =   Continuous
IDC_CHECK_SELECT                   =   Select
IDC_STATIC_PART                    =   Part
IDC_STATIC_TOTAL                   =   Total
IDC_BUTTON_POWERON                 =   Power on
IDC_BUTTON_PARAM                   =   Parameter(F3)

##Param DLG
IDC_CHK_DEFAULT_PARAM              =   Default parameter
IDC_STATIC_CUR_PEN                 =   Current pen
IDC_STATIC_MACHINE_COUNT           =   Machine count
IDC_STATIC_RUN_SPEED               =   Speed
IDC_STATIC_LASER_POWER             =   Power
IDC_STATIC_LASER_HZ                =   Frequency(KHZ)
IDC_STATIC_ZKB                     =   Pulse width
IDC_STATIC_OPEN_DELAY              =   Open delay(us)
IDC_STATIC_SHUT_DELAY              =   Shut delay(us)
IDC_STATIC_END_DELAY               =   End delay(us)
IDC_STATIC_CORNER_DELAY            =   Corner delay(us)
IDC_STATIC_STEP_DELAY              =   Step delay(us)
IDC_ADVANCE                        =   Advance
IDC_STATIC_PARNM                   =   Parameter name
IDC_LOAD_DEFAULT                   =   Read original parameter
IDC_SAVE                           =   Save 
IDC_SAVE_DEFAULT                   =   Save as default param
IDS_DEFAULT_PARAM                  =   Default parameter
##陈列DLG
DLG_MATR_TITLE                     =   Array
IDC_GROUPBOX_ARRAY                 =   Array type 
IDC_RADIO_RECTANGLE                =   Rectangle
IDC_RADIO_CIRCLE                   =   Circle

##
IDC_STATIC_MATNUM                  =   Array numver
IDC_STATIC_MATDIA                  =   Radius
IDC_STATIC_MATSTANGLE              =   Start angle
IDC_STATIC_MATAGDIT                =   Angle distance
IDC_RADIO_DIRECTION                =   Point center
IDC_RADIO_DIRECTION2               =   Forward direction

##
IDC_HOR_NUM                        =   Horizongtal number
IDC_VER_NUM                        =   Vertical number
IDC_HOR_DIST                       =   Horizontal distance
IDC_VER_DIST                       =   Vertical distance
IDC_GROUPBOX_DISTANCE              =   Calculate method of space
IDC_RADIO_OP                       =   Calculate by offset distance
IDC_RADIO_SP                       =   Calculate by graph distance

##
DLG_CHG_TITLE                      =   Change

##
IDC_STATIC_POST                    =   Position
IDC_CHK_RELATIVE_POS               =   Relative position
IDC_BTN_APPLY_COPY                 =   Apply to copy object
IDC_BTN_APPLY                      =   Apply
##
IDC_STATIC_ANG                     =   Angle
IDC_STATIC_CENT                    =   Center
IDC_CHK_RELATIVE_POS               =   Relative postion
##Ratio                            =
IDC_STATIC_RATIO                   =   Ratio
IDC_STATIC_OBJECT                  =   Object

##Size
IDC_STATIC_SIZE                    =   Size
##
IDC_STATIC_SLOPE                   =   Slope
## Name DLG                        =
DLG_NAME_TILTE                     =   Title
##
DLG_BASE_SEL_POS_TITLE             =   Select reference of position
##
IDC_STATIC_POST                    =   Position
IDC_BTN_TEAM                       =   Array
IDC_BTN_INPORT                     =   Input port
##
IDC_STATIC_STARTDEG                =   Start Degree
IDC_STATIC_ENDDEG                  =   End degree

##
DLG_ARR_TITLE                      =   Array
IDC_STATIC_NUM                     =   Number
IDC_STATIC_INC                     =   Increase[mm]

##
IDC_STATIC_DIA                     =   Diameter
##
IDC_STATIC_WTM                     =   Wait time
##
IDC_STATIC_MVDST                   =   Encoder distance
##
IDC_BUTTON_FILL                    =   Fill
IDC_BUTTON_BAR_OPTION              =   Code
IDC_STATIC_HEIGHT                  =   Height
IDC_CHECK_VARIABLE_TEXT            =   Variable text
IDC_RADIO_TEXT_DISTANCE            =   Distance
IDC_STATIC_DISTANCE_CONTROL        =   Distance control
IDC_RADIO_TEXT_DISTANCE2           =   Center distance
IDC_BUTTON_ADD                     =   Add
IDC_BUTTON_DEL                     =   Delete
IDC_BUTTON_MOVEUP                  =   Pre
IDC_BUTTON_MOVEDOWN                =   Next
IDC_BUTTON_MODIFY                  =   Modify
##
IDC_STATIC_IOCON                   =   I/O control
IDC_STATIC_TIP                     =   Prompt
IDC_CHK_ENABLE                     =   enable
##
IDC_GROUPBOX_OUTPUT                =   Set output port
IDC_STATIC_US                      =   US
##
IDC_CHECK_DPI_FIXED                =   Fixed DPI
IDC_CHECK_GRAY                     =   Gray
IDC_BTN_BMP_PROCESS_EXPAND         =   Expand
IDC_STATIC_DBB                     =   Contrast
IDC_STATIC_BRI                     =   Brightness
IDC_CHECK_CELL                     =   Dither
IDC_STATIC_TRIG                    =   Trig
IDC_CHECK_DUAL_DIRECTION           =   Bidirectional scan
IDC_CHECK_DOT_MODE                 =   Drill Mode
IDC_CHECK_AD_PT                    =   Pixel power adjustment
##
IDC_STATIC_EDN                     =   The number of edges
##
DLG_LX_TITLE                       =   Spiral
IDC_BUTTON_TYPE                    =   type
IDC_BUTTON_DIR                     =   Direction
IDC_STATIC_PENID                   =   Pen ID
IDC_STATIC_MINRAD                  =   Mini radius
IDC_STATIC_MIN_DIT                 =   Mini spiral pitch
IDC_STATIC_MAXDIT                  =   Max spiral pitch
IDC_STATIC_VAR                     =   Sprial pitch variable
IDC_STATIC_OUTEDG                  =   OUt edge loop
IDC_STATIC_INNER                   =   Inner edge loop

##
DLG_SYS_PARA_TITLE                 =   System parameter
##
IDC_CHECK_USEPWD                   =   Use password
IDC_STATIC_USER                    =   User
IDC_BUTTON1                        =   Add
IDC_BUTTON4                        =   Modify
IDC_BUTTON11                       =   Delete
##
IDC_STATIC_KEYBD                   =   Keyboard
IDC_STATIC_MIDIT                   =   Nudge Distance
IDC_STATIC_BIGRAT                  =   Big Nudge scale
IDC_STATIC_RAT                     =   Rotate angle
IDC_STATIC_ORI                     =   The way to go origin
IDC_STATIC_INOR                    =   Input point
##
IDC_STATIC_PORT                    =   Port
IDC_STATIC_BIT                     =   BaudRate
IDC_STATIC_DATABIT                 =   DataBits
IDC_STATIC_STPBIT                  =   StopBits
IDC_STATIC_MOD                     =   Parity
IDC_STATIC_CMD                     =   Command
##Text element DLG                 
DLG_TXT_ELE_TITLE                  =   Text element
IDC_STATIC_ELETYPE                 =   Element type
IDC_RD_FIXTXT                      =   Fix text
IDC_RD_SERTXT                      =   Serial text
IDC_RD_DATE                        =   Date
IDC_RD_TIME                        =   Time
IDC_RD_TCP                         =   TCP/IP communication
IDC_RD_COM                         =   Serial communication
IDC_RD_SQL                         =   SQL database
IDC_RD_FILE                        =   File
IDC_RD_KEY                         =   Keyboard
IDC_CHECK_NO_LEAD_ZERO             =   No lead zero
IDC_STATIC_TEXT                    =   Text
IDC_GROUP_TEXTTYPE                 =   Text type
IDC_RADIO_TEXTTYPE                 =   Text
IDC_RADIO_TEXTTYPE2                =   Change Line character
IDC_RADIO_TEXTTYPE3                =   User name

##
IDC_STATIC_STINDEX                 =   Start index
IDC_STATIC_CURINDEX                =   Current index
IDC_STATIC_ENDINDEX                =   End index
IDC_STATIC_INCR                    =   Increase
IDC_STATIC_PERMK                   =   Per mark
IDC_STATIC_MODE                    =   Mode
IDC_STATIC_RESET                   =   Reset
IDC_STATIC_CURMK                   =   Current mark
IDC_CHECK_FILTER_SN                =   Filter the following serial number
##
IDC_STATIC_SQLDR                   =   SQL driver
IDC_STATIC_SRC                     =   Data source
IDC_STATIC_DB                      =   Database title
IDC_STATIC_ID                      =   User ID
IDC_STATIC_PWD                     =   Password
IDC_STATIC_SQLCMD                  =   SQL command
IDC_STATIC_LINE                    =   Line
IDC_STATIC_INC                     =   Increase
IDC_CHECK_AUTO_RESET               =   Auto reset
IDC_CHECK_READ_ALL                 =   Read all
##
IDC_STATIC_IPADD                   =   IP address
IDC_STATIC_PORT                    =   Port number
IDC_STATIC_CMD                     =   Command
IDC_CHECK_UNICODE                  =   Unicode
##
IDC_RADIO1_H24                     =   Hour-24
IDC_RADIO2_H12                     =   Hour-12
IDC_RADIO3_MIN                     =   Minute
IDC_RADIO4_SEC                     =   Second
IDC_RADIO5_QU                      =   Time section
IDC_STATIC_AM_START                =   AM start
IDC_STATIC_PM_START                =   PM start
##
DLG_PIC_PROP_TITLE                 =   Picture property
IDC_STATIC_PRE                     =   Picture preview
IDC_STATIC_FILE                    =   FILE

##DLL- Window
DLG_FLY_TITLE                      =   Fly title-
IDC_CHECK_FLYMARK                  =   Fly mark
IDC_CHECK_RISING_EDGE              =   Rising edge trigger
IDC_FLYRIGHT2LEFT                  =   Pipeline from right to left
IDC_FLYCONTINUEMODE                =   On-the-fly continuous mode
IDC_CHECK_SIM_FLY                  =   Enable speed simulation
IDC_STATIC_LAN                     =   Cable mark
IDC_STATIC_MKDIST                  =   Mark distance
IDC_STATIC_INI                     =   Initial movement distance
IDC_STATIC_FLYV                    =   Coefficient
IDC_STATIC_UNIT                    =   UM/Impulse
IDC_BTN_COMPUTE                    =   Caculate
IDC_STATIC_INPUTPORT               =   Input port
##
DLG_CMP_RATIO_TITLE                =   Calculate scale
IDC_STATIC_OBSIZE                  =   Desired marking size
IDC_STATIC_FTSIZE                  =   Actual mark size
##
DLG_A_TITLE                        =   Current map
IDC_STATIC_RAFAT                   =   Real ratio(%)
IDC_CHECK_DA                       =   DA map(0-4096)
##
IDC_STATIC_ASPECT                  =   Aspect
IDC_STATIC_ARE                     =   Field size
IDC_STATIC_OFX                     =   Offset X
IDC_STATIC_OFY                     =   Offset Y
IDC_STATIC_ANGLE                   =   Angle
IDC_GALVO_1                        =   Galvo 1 - x
IDC_GALVO_2                        =   Galvo 2 - x
IDC_STATIC_GOTO                    =   Go to pos. after Mark 
IDC_NO_MOVE                        =   No movement
IDC_MOVE_TO_CENTER                 =   Galvo center
IDC_MOVE_LEFT_TOP                  =   Left top
IDC_MOVE_RIGHT_TOP                 =   Right top
IDC_MOVE_RIGHT_BT                  =   Right bottom
IDC_MOVE_LEFT_BT                   =   Left bottom
IDC_MOVE_SEP                       =   The specified location
IDC_STATIC_P1                      =   Galvo 1
IDC_STATIC_P2                      =   Galvo 2
IDC_REVERSE1                       =   Reverse
IDC_STATIC_RATIV                   =   Ratio
IDC_STATIC_PWD                     =   Password


##
DLG_FLY_SET_TITLE                  =   Fly parameter caculate
IDC_STATIC_FLY_TIP                 =   Please Control the pipelining to move a little distance; Measure the moved distance and fill the value into the box below; Then click OK, the parameter will be caculated automatically.
IDC_STATIC_LEN                     =   Distance:
IDC_STATIC_MUL                     =   Pulse count:
IDC_BTN_ZERO_CLEAR                 =   Clear
IDC_BTN_CALC_START                 =   Start Move
IDC_BTN_CALC_FINISH                =   End Move
IDC_BTN_CALC_SPEED                 =   Calc Speed

##
DLG_FREQ_TITLE                     =   Frequency
IDC_STATIC_FREQK                   =   Frequency(KHz)
IDC_STATIC_FARAT                   =   Real ratio

##
DLG_PWD_SET_TITLE                  =   Password

##
DLG_TEST_LAS_TITLE                 =   Test laser
IDC_BTN_LASERON                    =   Laser on
IDC_STATIC_FREQ                    =   Frequency
IDC_STATIC_PW                      =   Power
IDC_STATIC_MUWI                    =   Pulse width
IDC_STATIC_ONTM                    =   Laser on time 
##
IDC_STATIC_STMKDEL                 =   Start mark delay
IDC_STATIC_ENDMKDEL                =   End mark delay 
IDC_STATIC_MAXPW                   =   Max power delay 
IDC_STATIC_MAXFR                   =   Max frequency delay 
IDC_STATIC_LASMSL                  =   Laser sleep time
IDC_STATIC_MAXV                    =   Max speed
IDC_STATIC_MINV                    =   Min speed
IDC_STATIC_BUVMIS                  =   Curve scatter tolerance
IDC_SHOW_START_MARK_DLG            =   Show start mark dialogue 
IDC_ENABLE_CMD_FILE                =   Enable execute mark start and stop command file
IDC_AUTO_RESET_MARK_COUNT          =   Auto reset mark count
IDC_DISABLE_REACH_TOTAL_COUNT      =   Disable mark when reach total count
IDC_ENABLE_POWEROFF_SAVE_FILE      =   Power off save file
IDC_DISABLE_OPTIMIZE               =   Disable optimize continuous mark mode
IDC_STATIC_TOTM                    =   Total time
IDC_STATIC_TOTLJ                   =   Total part 
IDC_ENABLE_ANALOG                  =   Enable analog current fpk
IDC_ENABLE_OFFLINE                 =   Enable offline mark
IDC_STATIC_RPCNT                   =   Repeat count
IDC_USE_STEP_MARK_MODE             =   Use step mark mode
IDC_BUTTON_FLY                     =   Fly mark 
IDC_BUTTON_REDLIGHT                =   Red light(F1)
##
IDC_STATIC_STOPPT                  =   Stop marking port
IDC_STATIC_STOPTIP                 =   Stop prompt message
IDC_STATIC_DRPORT                  =   Door port
IDC_STATIC_IPORT                   =   Input port
IDC_STATIC_LAMOT                   =   Out port for Laser power 
IDC_STATIC_PRT                     =   Port
IDC_STATIC_RDPT                    =   Red Light Pointer output
IDC_STATIC_OPT                     =   IO Output
IDC_STATIC_INPUT                   =   IO input
IDC_STATIC_MKOUT                   =   Marking output
IDC_STATIC_STPT                    =   Start mark port
IDC_CHECK1                         =   Start Pulse Mode
IDC_STATIC_ROTPT                   =   Rotate Mark Signal Port

##
DLG_POWER_TITLE                    =   Power setup 
IDC_STATIC_PW                      =   Power(%)
IDC_STATIC_FTRT                    =   Real ratio(%)

##
DLG_PWDDLL_SET_TITLE               =   Password set
IDC_STATIC_PWDDLL                  =   Password
##
DLG_REDLT_TITLE                    =   Red light pointer
IDC_STATIC_RDV                     =   light Speed
IDC_CHECK_ENRD                     =   Enable show contour
IDC_CHECK_ENCTWK                   =   Enable continuous mark mode
IDC_STATIC_SIZERTX                 =   Size scale X
IDC_STATIC_SIZERTY                 =   Size scale Y
IDC_BTN_REDLIGHT_PREVIEW           =   Red light preview

##
DLG_CFG_MAK_TITLE                  =   Configuration
##
IDC_STATIC_LASTYPE                 =   Laser type
IDC_STATIC_PMW                     =   PWM
IDC_CHECK_PWM_OUT                  =   Enable PWM Signal
IDC_STATIC_MAXPWM                  =   Max PWM signal
IDC_STATIC_MINPWM                  =   Min PWM signal
IDC_STATIC_KHZ                     =   KHz
IDC_PWM_POWER_MAP                  =   Power map
IDC_CHECK_TICKLE                   =   Enable Tickle
IDC_STATIC_MULW                    =   Pulse Width
IDC_STATIC_MULFR                   =   Pulse freq
IDC_CHECK_FPK                      =   Enable CO2 FPK
IDC_STATIC_FMPW                    =   FPK Start power
IDC_CHECK_FPK_MODE                 =   Enable CO2 FPK
IDC_STATIC_MNOUT                   =   Analog output
IDC_POWER_ANGLOG_OUT               =   Enable current output
IDC_FREQ_ANGLOG_OUT                =   Enable frequency analog output
IDC_ANALOG_FIRSTPULSEKILLER        =   Enable analog FPK 
IDC_STATIC_SWITCH                  =   Switch
IDC_CHECK_USE_QSWITCH              =   Use Digital Q-Switch driver
IDC_CHECK_QSWITCH_OPEN_FPK         =   QSwitch Open When FPK end
IDC_STATIC_FMS                     =   FPK
IDC_CHECK_FIRSTPULSE_REVERSE       =   Pulse width reverse
IDC_CHEK_LASM_SIG                  =   No check laser return signal
IDC_OPEN_MO                        =   Open MO delay
IDC_STATIC_WAVE                    =   Wave
IDC_CHECK_PWM_OUT5                 =   Continuous
IDC_STATIC_WTPW                    =   Wait test power
IDC_POWER_MAP                      =   Power map 
IDC_FREQ_MAP                       =   Frequency map
IDC_BTN_LASER                      =   Test laser
##
DLG_DLLTIP_TITLE                   =   Prompt
IDC_STATIC_ISSTART                 =   Are you sure about Starting marking?
##
IDS_ALARM_STATE                    =   It may impact the performance of the laser if not checking its state!
##
STOP                               =   Stop
IDS_WAIT_HOST                      =   WAIT FOR ANSWER...
IDS_REDLIGHT                       =   Red light marking...
##
IDC_STATIC_INTER                   =   After cross processing 
IDC_CHECK_KEEP_ORIGINAL            =   Save source object
IDC_CHECK_KEEP_OBJECTIVE           =   Save target object
IDC_BTN_HANJIE                     =   Weld to...
##
IDC_STATIC_CUT_LEN                 =   cut length
IDC_STATIC_AUTODIT                 =   Automatic connection spacing
IDC_STATIC_MULCP                   =   multi operation
##
IDC_STATIC_INVAL                   =   The change will be ineffective until next start
IDC_STATIC_PASTEY3                 =   Note: the smaller the coefficient,The more points, more smooth
IDC_STATIC_PASTEY2                 =   Smoothing coefficient
IDC_CHK_MULTIMARK                  =   Multi card marking
IDC_CHECK_CORFILE                  =   use calibration file
IDC_STATIC_FIRSTIN                 =   FPK Increment power
IDC_CHECK_START_PULSE              =   Pulse Mode
IDS_CHAR_MODL                      =   Dec;HEX;hex
IDC_STATIC_DTOFF                   =   Date Offset
BYYEAR                             =   By year
BYMONTH                            =   By month
BYDAY                              =   By day
IDC_ADV_MK_TITLE                   =   Advance mark param
IDC_STATIC_PARLIB                  =   Param library
IDS_MENU_OPER                      =   Operation
IDC_STATIC_AUTOSAVE_DESC           =   Save current data to file 'AutoSave.orz' in SeaCad directory at specified time space.
IDS_INPUT_VALID_NUM                =   please input a number between 10 and 1200

##Calibrate
IDD_DLG_CAL_LSM                    =   SeaThinking Laser Calibrate
IDC_STATIC_CAL_PN                  =   Pnt Num:
IDC_STATIC_CAL_PD                  =   Distance:
IDC_RESET                          =   Reset
IDC_STA_AREA_SIZE                  =   Field Size
IDC_MARK_CROSS                     =   Mark Cross Line
IDC_MARK_RECT                      =   Mark Cal Grid
IDC_SAVECOEF                       =   Save Coef
IDC_OK                             =   Close
IDC_CAL_HEADER_NO                  =   No
IDC_CAL_HEADER_XCAL                =   VXCal
IDC_CAL_HEADER_YCAL                =   VYCal
IDC_CAL_HEADER_XACT                =   VXAct
IDC_CAL_HEADER_YACT                =   VYAct
MSG_CAL_TIP                        =   Calibration Mark is finished!
IDC_STA_AREA_SIZE2                 =   Two Cal Size
IDC_MARK_CHECKED                   =   Mark Cal Square
MSG_CAL_NEEDSAVE                   =   Please Save Coef!

##IDR_MENU_RPOP
ID_RPOP_REPEAT_COMMAND             =  Repeat Current Command

IDC_STATIC_TXTANG                  =   Angle of text
IDC_STATIC_STOP_SIG                =   Stop signal trigger ! marking stopped!
IDC_MARK_DLGPARA                   =   mark parameter configure

##Tip messages
[TIPS]
ID_FILE_NEW_57600                  =  New(&N)\nCreate a new document\nNew
ID_FILE_OPEN_57601                 =  Open(&O)\nOpen an exist document\nOpen
ID_FILE_CLOSE_57602                =  \nClose the Active Document\nClose
ID_FILE_SAVE_57603                 =  \nSave the Active Document\nSave
ID_FILE_SAVE_AS_57604              =  Save as...\nSaves the active document with a new name\nSave as
ID_FILE_PAGE_SETUP_57605           =  Page Setup\nTo change the page options\nPage Setup
ID_FILE_PRINT_SETUP_57606          =  \nChange the printer and print options\nPrint Setup
ID_FILE_PRINT_57607                =  \nPrint the active document\nPrint
ID_FILE_PRINT_PREVIEW_57609        =  \nDisplay full pages\nPrint preview

ID_EDIT_CLEAR_57632                =  \nDelete selected objects\nDelete
ID_EDIT_CLEAR_ALL_57633            =  \nDelete all\nDelete all
ID_EDIT_COPY_57634                 =  \nCopy the selected object into the clipboard\nCopy
ID_EDIT_CUT_57635                  =  \nCut the selected object into the clipboard\nCut
ID_EDIT_FIND_57636                 =  \nsearch the selected text\nsearch
ID_EDIT_PASTE_57637                =  \nInsert clipboard contents\nPaste
ID_EDIT_REPEAT_57640               =  \nRepeat the previous step operation\nRepeat
ID_EDIT_REPLACE_57641              =  \nReplace selected object with different object\nReplace
ID_EDIT_SELECT_ALL_57642           =  \nSelect all drawing objects\nSelect all
ID_EDIT_UNDO_57643                 =  \nUndo the last step of the operation\nUndo
ID_EDIT_REDO_57644                 =  \nRedo the last step of the undoed operation\nRedo

ID_ZOOM_WNDZOOM_32808              =  \nZoom window\nZoom
ID_ZOOM_MOVE_32809                 =  \nMove Drawings\nMove
ID_ZOOM_ZOOMIN_32810               =  \nZoomin display\nZoomin
ID_ZOOM_ZOOMOUT_32811              =  \nZoomout display\nZoomout
ID_ZOOM_VIEWALL_32812              =  \nMaximum view all objects\nAll view
ID_ZOOM_VIEWSELECTED_32813         =  \nMaximum view selected objects\nSelected view
ID_ZOOM_VIEWPLACE_32814            =  \nView workplace area\nWorkArea view

ID_TOOL_PICK_32787                 =  \nSelect drawings\nDrawing pick
ID_TOOL_ITEMEDIT_32788             =  \nEdit graph node\nEdit node
ID_TOOL_LINE_32789                 =  \nDraw a line\nDraw line
ID_TOOL_CURVE_32790                =  \nDraw a curve\nDraw curve
ID_TOOL_RECTANGLE_32791            =  \nDraw a rectangle\nDraw rect
ID_FILL_SHAPE_32796                =  \nFill the selected object\nFill                     
ID_TOOL_CIRCLE_32799               =  \nDraw a circle\nDraw circle
ID_TOOL_ELLIPSE_32800              =  \nDraw an ellipse\nDraw ellipse
ID_TOOL_POLYGON_32801              =  \nDraw a polygon\nDraw polygon
ID_TOOL_FONT_32802                 =  \nDraw a text\nDraw text
ID_TOOL_VECTORS_32804              =  \nDraw a vector file\nDraw vector
ID_TOOL_BARCODE_32805              =  \nDraw a barcode\nDraw barcode
ID_TOOL_TIMER_32806                =  \nDraw a delay timer\nDraw timer
ID_TOOL_INPORT_32807               =  \nDraw an inport\nDraw inport
ID_TOOL_BMP_32815                  =  \nDraw a picture file\nDraw picture
ID_TOOL_OUTPORT_32816              =  \nDraw an outport\nDraw outport

ID_GROUP_SHAPE_32862               =  \nCompose the selected objects into a group\nGroup
ID_UNGROUP_SHAPE_32863             =  \nDecompose the selected group\nUngroup
ID_COMBINE_SHAPE_32864             =  \nCombine the selected objects\nCombine
ID_UNCOMBINE_SHAPE_32865           =  \nDecombine the select combination\nDecombine

ID_FILE_SYSPARAM_32970             =  \nConfigure the system parameters\nSys Param

ID_EDIT_SORT_32899                 =  \nOptimize the path of the selected drawing\nSort

IDC_ALIGN_CENTER_32843             = \nAlign by Center\nCenter align
IDC_ALIGN_LEFT_32837               = \nLeft align\nLeft align
IDC_ALIGN_RIGHT_32838              = \nRight align\nRight align
IDC_ALIGN_TOP_32840                = \nTop align\nTop align
IDC_ALIGN_BOTTOM_32841             = \nBottom align\nBottom align
IDC_ALIGN_CENTER_Y_32839           = \nThe middle vertical alignment\nCenter Y
IDC_ALIGN_CENTER_X_32842           = \nThe middle horizontal alignment\nCenter X

IDC_LOCK_SHAPE_32844               = \nLock the selected objects\nLock
IDC_UNLOCK_SHAPE_32847             = \nUnlock the selected objects\nUnlock
IDC_UNLOCK_ALLSHAPE_32848          = \nUnlcok all objects\nUnlock all
IDC_MOVESHAPE_CENTER_32849         = \nPlace the drawing at origin\nPlace at origin
IDC_SEL_BY_PEN_32850               = \nSelect drawings by pen number\nSelect by pen
IDC_MIRROR_X_32853                 = Mirror X\nHorizontal mirror\nMirror X
IDC_MIRROR_Y_32854                 = Mirror Y\nVertical mirror\nMirror Y
IDC_GRAPH_PATH_32851               = Show path\nShow or hide the path of drawings\nShow or hide path
ID_VIEW_ARROW_32875                = Show path\nShow or hide the path of drawings\nShow or hide path

ID_LASER_ROC2_32971                = 360 Rotate Mark\n360 degree Rotate Mark\n360 degree Rotate Mark
ID_LASER_ROT_CFG_40017             = Rotate config & check\nRotate Config\nRotate Parameter config and Axis check

IDM_LSM_CALIB_40008                = Curve fiting Cal\nCurve fiting Cal\nCurve fiting Cal


[Others]
##
IDS_PORT_DEF_MKPORT                = The input port has defined at the beginning of marking input port
IDS_PORT_DEF_RDPORT                = The input port has defined in a red light input port
IDS_DEF_CONFLICT_PORT_OUT          = Outport Definition is conflict
IDS_DEF_CONFLICT_PORT_IN           = Inport Definition is conflict
##
IDS_VAR_ADV                        = ADVANCE
IDC_CHK_ENA_SPLIT                  = Enable split string to change other text entity
IDC_CHK_MKSELF                     = Mark Self
IDC_CHK_FIXLEN                     = Enable fixed text width
IDC_BTN_ADD                        = Add
IDC_BTN_ADVDEL                     = Delele
IDC_BTN_ADVMOD                     = Modify
##
IDS_VAR_ADV_PARA                   = parameter
IDC_STATIC_FIRSTPOS                = Index of the first character in string
IDC_STATIC_GETNUM                  = The number of characters to extract from string
IDC_STATIC_GETNUM2                 = The name of text entity which you want to change
##
IDS_FPGA_HD_INFO                   = Hardware infomation
IDC_STATIC_CD_VER                  = version
IDC_CHK_HIG_THRIG                  = High level trigger
##
IDC_STATIC_JMQ                     = meter counter(m)
IDC_CHECK_INSIDE                   = Text is Inside of arc
##
OPEN_VECTOR_FILE_FAIL              = The vector file format is not supported
IDS_SUP_RANGE                      = Coordinates range of galvanometer 
##
IDS_SOFT_TRIAL_VER                 = Software is a trial version, please contact the supplier  to get the registration code
IDS_SOFT_EXPIRE                    = Software has passed the trial period, the software will exit after 5 minutes, please contact the software vendor!
IDS_MENU_REG                       = Software Registration
##
IDS_DLG_REG_TITLE                  = Software Registration
IDC_STATIC_CODE                    = Encoding
IDC_STATIC_IN_SERI                 = Enter the registration code
IDC_STATIC_HAS_REG                 = Software has been registered
##
IDS_MENU_HELP_DOC                  = help
IDS_DLG_INPORT_MARK                = inpurt port mark
IDS_REG_CODE_HASREG                = Registration code has been registered
##
IDS_LOCK_SIDE                      = Lock the sidebar
IDS_CARD_ID_EMPTY                  = card id is empty
IDS_INVAL_SUP_CODE                 = invalid register code,supplier error
IDS_REG_SUC                        = regist sucess
IDS_CARD_INVALID                   = card is not exist
IDC_CHK_SUPSLEN                    = enable super long marking
IDC_STATIC_SPLSIZE                 = split size
IDC_STATIC_OFFSET                  = compensate the spacing
IDS_INVAL_CODE                     = invalid register code
##
IDS_QR_CODE_MATRIX                 = default|ver1(21*21)|ver2(25*25)|ver3(29*29)|ver4(33*33)|ver5(37*37)|ver6(41*41)|ver7(45*45)|ver8(49*49)|ver9(53*53)|ver10(57*57)|ver11(61*61)
IDS_HANXIN_MATRIX                  = default|ver1(23*23)|ver2(25*25)|ver3(27*27)|ver4(29*29)|ver5(31*31)|ver6(33*33)|ver7(35*35)|ver8(37*37)|ver9(39*39)|ver10(41*41)|ver11(43*43)
IDC_STATIC_LEVEL                   = Error level
IDC_STATIC_MATRIX                  = matrix
##
IDC_FILE_TXT                       = TXT
IDC_FILE_EXCEL                     = EXCEL
IDC_FILE_NAME                      = FILE NAME
IDC_FILE_LIST                      = FILE LIST
##
IDC_CHK_LEAK                       = Leakage treatment   
IDC_CHK_UPDATE                     = update state to db
##
IDS_PWD_SPACE                      = Do not include the space key in the password
##
MENU_LAS_FILESMARK                 = Multi files mark
MENU_ALIGN_EQUAL_HOR               = Hor equidistance
MENU_ALIGN_EQUAL_VER               = Ver equidistance
IDS_FONT_VERM                      = Character facing
IDC_STATIC_MKRES                   = limit count
IDC_STATIC_MKRES2                  = tip
##
MENU_LAS_MOVEMARK                  = Mobile mark
IDC_STATIC_MOVEMARK                = Marking program
IDC_BUTTON_AXIS_PARAM              = Extended axis parameter
IDC_BTN_MOVE_PARAM                 = Move parameter
IDC_BUTTON_RUN                     = Move
IDC_STATIC_DISTANCE                = Move distance
IDC_STATIC_RUNING                  = Running
IDC_STATIC_CANMARK                 = Marking way
IDC_STATIC_TIMES                   = Marking number
IDC_RADIO_ALIGN_UP                 = UP
IDC_RADIO_ALIGN_DOWN               = DOWN
IDC_CMB_STATIC_MARK                = Under rest marking
IDC_CMB_CANNOT_MARK                = Not marking
IDC_BUTTON_SAVEMARK                = Save solution
IDC_BUTTON_DELMARK                 = Delete solution
IDC_CHK_MONITOR_PORTS              = Use composite port
IDC_STATIC_MOVEMACHINE             = Move machine
IDC_STATIC_MOVETEST                = Move test
IDC_STATIC_TIMESTEP                = Used time
IDC_STATIC_RETURNWAY               = Return by way
IDC_STATIC_BACKZERO                = Straight back to the origin
IDC_STATIC_SETCD                   = Set coordinate
IDC_STATIC_LINELONG                = Length
IDC_STATIC_ZERO                    = Origin
IDC_STATIC_START                   = Starting point
IDC_STATIC_NOW                     = Current point
IDC_STATIC_TARGET                  = Target point
IDC_CMB_RETRUNSTART                = Return start
IDC_CMB_GOTOTARGET                 = Go to target
IDC_STATIC_UNITDISTANCE            = Unit distance
IDC_STATIC_UNITTIME                = Unit time
IDC_CMB_RESETPIC                   = Reset
IDC_MEG_GONO                       = Whether to continue?
IDC_MEG_OUTLOOPS                   = Target point out of bounds!
IDC_MEG_RETRUNSTART                = Current point is't Starting,Whether to move to Starting?
IDS_MOVING                         = Moving
IDS_MOVE_FINISH                    = Move finish
IDC_STATIC_MARKTIMES               = Finish mark times
IDC_STATIC_MOVEGALVA               = Move galva
IDC_STATIC_MOVEDEVICE              = Move device
MENU_LAS_CUTMARK                   = Cut mark
MENU_LAS_CUTNUM                    = Cut number
IDC_STATIC_LPMM                    = Mark density(point/mm)
##
IDS_MAINFRMTIP                     = Seathinking software
IDC_STATIC_USETIME                 = From the end of the trial software is still%d days
IDS_SYSTEM_TIME_FAIL               = The latest system time and board time is not consistent, pls set the system time or contact the supplier
IDS_SOFT_NOT_USE                   = Software is about to expire, please register as soon as possible.
##
IDS_USB_COMM_ERROR                 = USB COMMUNICATE ERROR
##
IDC_STATIC_FAULT                   = Moving error
IDC_STATIC_MOVEDIR                 = Moving direction
##
IDC_STATIC_MKLIMIT                 = limit mark count 
IDC_CHK_GENDIS                     = litter use parameter enable editing
IDS_SELECT_FILEOUT                 = File not specified
IDS_TEXT_HAS_MARKED                = TEXT HAS been MARKED 
IDC_CHK_SWITCH_TRIG                = trigged by port
##
IDD_TXT_SAVEOUT                    = output text
IDC_CHK_OUT_TXT                    = Processing output text to the specified file
IDC_CHK_OUT_TIME                   = Processing output time to the specified file
IDC_CHK_MARK_FLAG                  = Check if the text has been marked.
IDC_STATIC_FILE_OUT                = File name
IDC_CHK_REDPORTCNT                 = redlighting and marking use port 
##
IDS_SET_G_UNIT                     = Unit
IDC_STATIC_PATTERN_RANGE           = Range
IDC_STATIC_FAULT2                  = Dislocation
IDS_OFFLINE_MARK                   = off line marking...
##
IDC_CHECK_FIXED                    = Fixed cut

IDC_CHECK_FIXED                    = Fixed cut
IDS_CURVE_DRAW                     = draw curve
IDS_REC_DRAW                       = draw rectangle
IDS_CIRCLE_DRAW                    = draw circle
IDS_ECLLI_DRAW                     = draw ecllipe
IDS_POLY_DRAW                      = draw poly
IDS_INPORT_DRAW                    = draw in-port
IDS_OUTPORT_DRAW                   = draw out-port
IDS_SORT_DRAW                      = sort
IDS_TEXT_DRAW                      = draw text
IDS_TBARCODE_DRAW                  = draw tbarcode
IDS_ENCODEDIT_DRAW                 = draw encode
IDS_DELAY_DRAW                     = draw delay
IDS_POINT_DRAW                     = draw point
IDS_LINERIT_DRAW                   = draw line
##
IDC_STATIC_TIP_KEY                 = tip
IDS_KEYBD_INPUT                    = pls input text
IDC_CHK_FIXTXT                     = fix text
IDC_CHK_KEY_SET                    = text number
IDC_CHECK_FIXED                    = Fixed cut
##
IDC_STATIC_MINDOTTIME              = Depth
##
IDC_STATIC_STARTPARAM              = Please confirm whether the parameter is  right!
ID_DRAW_EXTAXI                     = extend Axis
IDS_PUL_PERUNIT                    = pulse/mm
IDS_PUL_PERDEG                     = pulse/degree
IDS_EXT_AXI1                       = Axis1
IDS_EXT_AXI2                       = Axis2
IDC_CHK_ZERO                       = Correct origin
IDC_CHK_EXTREL                     = relative
IDC_STATIC_MOVE                    = move
IDC_BTN_EXT                        = extend
IDC_STATIC_UNITTYPE2               = pulse per unit
IDS_EXT_AXI_BKZERO                 = Axis origining...
IDS_BKZERO_TIMEOUT                 = origin timeout
IDC_STATIC_FV                      = line speed(cm/s)
IDS_2D_PTMODE                      = POINT MODE
